bgr4-api/app/controllers/application_controller.rb

  def current_user
    return nil unless request.headers['Authorization']

    token = request.headers['Authorization'].split(' ').last
    begin
      decoded_token = JWT.decode(token, Rails.application.credentials.secret_key_base, true, algorithm: 'HS256')
      User.find(decoded_token[0]['user_id'])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 4 LIMIT 1