bgr4-api/app/controllers/api/v1/auth_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "provider", "uid", "avatar_url", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at") VALUES ('test', 'test6@test.com', '2025-02-17 10:50:59.071641', '2025-02-17 10:50:59.071641', NULL, NULL, NULL, '$2a$12$dviKt6xSI0fMOym/3gsPRuZTD624SNi1QDVfa6C1K1jQW0gp4MqeO', NULL, NULL, NULL) RETURNING "id"
---
      def signup
        user = User.new(user_params)

        if user.save

SELECT "users".* FROM "users" WHERE "users"."email" = 'test@example.com' LIMIT 1
---
      def login
        user = User.find_by(email: params[:email]&.downcase)