bgr4-api/app/controllers/api/v1/games_controller.rb

SELECT "games".* FROM "games"
---
      def index
        # ページネーションパラメータを取得
        page = params[:page].present? ? params[:page].to_i : 1
        per_page = params[:per_page].present? ? params[:per_page].to_i : 24

        # ソートパラメータを取得（デフォルトはレビュー新着順）
        sort_by = params[:sort_by].present? ? params[:sort_by] : 'review_date'

        # 総ゲーム数を取得
        total_count = Game.count

        # ソート順に応じてクエリを構築
        query = Game.all

INSERT INTO "games" ("name", "description", "image_url", "min_players", "max_players", "play_time", "average_score", "bgg_id", "created_at", "updated_at") VALUES ('Sail Legacy', 'Assemble your crew, captain your ship, and take on the high seas in this legacy co-op trick-taker!&#10;&#10;In Sail Legacy, you and your best matey will go on an adventure across thirty unique missions. Upgrade your ship, outfit your characters, and tune the deck itself to avoid a watery grave!&#10;&#10;Sail Legacy evolves from the core Sail game mechanisms as you cooperatively use &quot;must-follow&quot; trick-taking to take on the unforgiving ocean &mdash; and the mythical beasts that call it home. Based on the combination of symbols in the trick, you''ll steer the ship, charge ahead, or fire the cannons. Throughout the game, you''ll tweak your pirate''s asymmetric player powers. Will you have a well-balanced team or specialize in one area?&#10;&#10;An epic campaign awaits. Live with the consequences of numerous branching decisions. Express your creativity with customization. Most of all, don''t sink. No two tales will be the same!&#10;&#10;&mdash;description from the publisher&#10;&#10;', 'https://cf.geekdo-images.com/lRNcxndptSAF_-_pULQl5w__original/img/GF-ON0XJNb_XaXoEWUTGO-cLbC8=/0x0/filters:format(jpeg)/pic8694781.jpg', 2, 2, 45, 5.1, '438975', '2025-02-15 17:19:01.454363', '2025-02-15 17:19:01.454363') RETURNING "id"
---
          system_user_id = User.find_by(email: 'system@boardgamereview.com')&.id

          # システムユーザーのレビューを除外するが、レビューがないゲームも含める
          query = Game.left_joins(:reviews)
                      .where("reviews.id IS NULL OR reviews.user_id != ?", system_user_id)
                      .group('games.id')
                      .select('games.*, MAX(reviews.created_at) as latest_review_date')
                      .order('latest_review_date DESC NULLS LAST, games.created_at DESC')

SELECT "users".* FROM "users" WHERE "users"."id" IN (2, 3)
SELECT "reviews".* FROM "reviews" WHERE "reviews"."game_id" = $1  [["game_id", "377470"]]
---
      def show
        # レビューにユーザー情報を含める（システムユーザーのレビューを除外）
        reviews_with_users = @game.reviews.exclude_system_user.includes(:user).map do |review|

SELECT "games".* FROM "games" WHERE "games"."bgg_id" = $1 LIMIT $2  [["bgg_id", "438975"], ["LIMIT", 1]]
---
      def create
        # フロントエンドから送信されたパラメータを取得
        game_params = params[:game]

        # パラメータが不足している場合はエラーを返す
        if game_params.blank? || game_params[:bgg_id].blank?

INSERT INTO "games" ("name", "description", "image_url", "min_players", "max_players", "play_time", "average_score", "bgg_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
        # 日本語出版社名を正規化
        @game.normalize_japanese_publisher if @game.japanese_publisher.present?

        if @game.save

SELECT "games".* FROM "games" WHERE "games"."bgg_id" = '418059' LIMIT 1
---
      def set_game
        @game = Game.find_by(bgg_id: params[:id]) || Game.find_by(id: params[:id])