bgr4-api/app/controllers/api/v1/reviews_controller.rb

      def create
        Rails.logger.info "Creating review with params: #{review_params.inspect}"
        Rails.logger.info "Current user: #{current_user.inspect}"
        Rails.logger.info "Game: #{@game.inspect}"

        begin
          # 既存のレビューを探す
          @review = Review.find_by(user: current_user, game_id: @game.bgg_id)

          if @review
            # 既存のレビューを更新
            Rails.logger.info "Updating existing review: #{@review.inspect}"
            if @review.update(review_params)
              render json: review_with_details(@review), status: :ok
            else
              Rails.logger.error "Review update failed: #{@review.errors.full_messages}"
              render json: { errors: @review.errors.full_messages }, status: :unprocessable_entity
            end
          else
            # 新しいレビューを作成
            Rails.logger.info "Creating new review"
            @review = @game.reviews.build(review_params)
            @review.user = current_user

            if @review.save
              # ゲームの平均スコアを更新
              @game.update(average_score: @game.reviews.average(:overall_score))
---
UPDATE "games" SET "average_score" = $1, "updated_at" = $2 WHERE "games"."id" = $3  [["average_score", "5.0"], ["updated_at", "2025-02-21 13:20:53.259087"], ["id", 2]]
INSERT INTO "reviews" ("user_id", "game_id", "overall_score", "play_time", "rule_complexity", "luck_factor", "interaction", "downtime", "recommended_players", "mechanics", "tags", "custom_tags", "short_comment", "created_at", "updated_at") VALUES (1, '1', 5.0, 3, 3.0, 3.0, 3.0, 3.0, '{}', '{}', '{}', '{}', 'te', '2025-02-15 17:17:40.532844', '2025-02-15 17:17:40.532844') RETURNING "id"
SELECT AVG("reviews"."overall_score") FROM "reviews" WHERE "reviews"."game_id" = '1'
SELECT "reviews".* FROM "reviews" ORDER BY "reviews"."created_at" DESC
SELECT "games".* FROM "games" WHERE "games"."bgg_id" = '418059' LIMIT 1

      def index
        @reviews = @game.reviews.exclude_system_user.includes(:user)
---
SELECT "reviews".* FROM "reviews" ORDER BY "reviews"."created_at" DESC

      def all
        per_page = (params[:per_page] || 12).to_i
        page = (params[:page] || 1).to_i

        @reviews = Review.exclude_system_user.includes(:user, :game)
                        .order(created_at: :desc)
                        .offset((page - 1) * per_page)
                        .limit(per_page)

        # ゲームごとのレビュー数を取得
        game_ids = @reviews.map { |review| review.game_id }.uniq
        reviews_count_by_game = Review.exclude_system_user
                                     .where(game_id: game_ids)
                                     .group(:game_id)
                                     .count

        # ユーザー情報を含めて返す
        render json: @reviews.map { |review|
---
SELECT "reviews".* FROM "reviews" ORDER BY "reviews"."created_at" DESC LIMIT 50
SELECT "users".* FROM "users" WHERE "users"."id" = 1

      def set_game
        @game = Game.find_by!(bgg_id: params[:game_id])
---
SELECT "games".* FROM "games" WHERE "games"."bgg_id" IN ('2', '1')