bgr4-api/app/controllers/auth/omniauth_callbacks_controller.rb

UPDATE "users" SET "updated_at" = $1, "confirmed_at" = $2 WHERE "users"."id" = $3  [["updated_at", "2025-02-22 08:19:14.870529"], ["confirmed_at", "2025-02-22 08:19:14.856297"], ["id", 15]]
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "provider", "uid", "avatar_url", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "tokens", "sign_in_count", "current_sign_in_at", "last_sign_in_at", "current_sign_in_ip", "last_sign_in_ip", "confirmation_token", "confirmed_at", "confirmation_sent_at", "unconfirmed_email", "image") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22) RETURNING "id"
UPDATE "users" SET "updated_at" = $1, "tokens" = $2, "confirmed_at" = $3 WHERE "users"."id" = $4  [["updated_at", "2025-02-22 08:38:37.224457"], ["tokens", "[FILTERED]"], ["confirmed_at", "2025-02-22 08:38:36.972567"], ["id", 15]]
---
    def omniauth_success
      Rails.logger.info "omniauth_success started"
      Rails.logger.info "Auth hash: #{auth_hash.inspect}"

      begin
        # 既存のユーザーを検索
        @resource = User.find_by(email: auth_hash['info']['email'])

        if @resource
          # 既存のユーザーが見つかった場合
          Rails.logger.info "Existing user found: #{@resource.inspect}"

          # プロバイダー情報を更新
          @resource.update!(
            provider: auth_hash['provider'],
            uid: auth_hash['uid']
          )
        else
          # 新規ユーザーの作成
          Rails.logger.info "Creating new user"
          @resource = User.new(
            email: auth_hash['info']['email'],
            name: auth_hash['info']['name'],
            provider: auth_hash['provider'],
            uid: auth_hash['uid'],
            password: Devise.friendly_token[0, 20]
          )
          @resource.skip_confirmation!
          @resource.save!