bgr4-api/app/controllers/auth/sessions_controller.rb

    def create
      # アカウントが有効化されているかチェック
      resource = User.find_by(email: params[:email] || params.dig(:session, :email))
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "[FILTERED]"], ["LIMIT", 1]]