bgr4-api/app/models/user.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "provider", "uid", "avatar_url") VALUES ('田中', 'iamtomatoo@gmail.com', '$2a$12$8c/BFUyhMg5WkO7URIVYLOavYcPA8YL0fmImY388LqyriWfcxjiFq', '2025-02-16 02:47:06.617264', '2025-02-16 02:47:06.617264', 'google_oauth2', '101670454808076415236', 'https://lh3.googleusercontent.com/a/ACg8ocJ2qpmscAzPwdu-u_d1cmr0Mqn8pvzjBjM_JXJLvGmPxnXlUw') RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."provider" = 'twitter' AND "users"."uid" = '1890983856196751361' LIMIT 1
---
  def self.from_omniauth(auth)
    where(provider: auth.provider, uid: auth.uid).first_or_create do |user|